In [1]:
import numpy as np
import pandas as pd

In [2]:
people = {
    "name": ["Finley", "Andrew", "Blake"],
    "last_name": ["Brown", "Bradley", "Hughes"],
    "age": [23,21,34]
         
}

In [3]:
df = pd.DataFrame(people)

In [4]:
df

     name last_name  age
0  Finley     Brown   23
1  Andrew   Bradley   21
2   Blake    Hughes   34

# DataFrame - Birden Çok Column'a Ulaşmak:

In [5]:
df

     name last_name  age
0  Finley     Brown   23
1  Andrew   Bradley   21
2   Blake    Hughes   34

In [7]:
df["name"]

0    Finley
1    Andrew
2     Blake
Name: name, dtype: object

In [5]:
df[["name", "last_name"]]

     name last_name
0  Finley     Brown
1  Andrew   Bradley
2   Blake    Hughes

* Hangi sıra ile veriyorsak o sırayla döndürüyor

In [6]:
df[["last_name", "name"]]

  last_name    name
0     Brown  Finley
1   Bradley  Andrew
2    Hughes   Blake

* Birden çok Series bir araya gelince DataFrame oluşturuyor demiştim:

In [7]:
df["last_name"]

0      Brown
1    Bradley
2     Hughes
Name: last_name, dtype: object

In [8]:
df["name"]

0    Finley
1    Andrew
2     Blake
Name: name, dtype: object

In [9]:
df[["last_name","name"]]

  last_name    name
0     Brown  Finley
1   Bradley  Andrew
2    Hughes   Blake

In [10]:
type(df[["last_name","name"]])

pandas.core.frame.DataFrame